In [5]:
import pandas as pd 

s = pd.Series([1, 2, 3, 4])
print(s)

0    1
1    2
2    3
3    4
dtype: int64

In [6]:
import pandas as pd

data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'Tanzim', 'Arunima ', 'Karim'],
    'Age': [25, 30, 35, 22, 25, 21],
    'City': ['New York', 'Los Angeles', 'Chicago', 'Dhaka', 'Chittagong', 'Khulna']
}

df = pd.DataFrame(data)
print(df)

       Name  Age         City
0     Alice   25     New York
1       Bob   30  Los Angeles
2   Charlie   35      Chicago
3    Tanzim   22        Dhaka
4  Arunima    25   Chittagong
5     Karim   21       Khulna

In [7]:
import pandas as pd
# Creating a Series
data = pd.Series([10, 20, 30, 40])
print(data)       # Series with default index

0    10
1    20
2    30
3    40
dtype: int64

In [8]:
df

       Name  Age         City
0     Alice   25     New York
1       Bob   30  Los Angeles
2   Charlie   35      Chicago
3    Tanzim   22        Dhaka
4  Arunima    25   Chittagong
5     Karim   21       Khulna

In [9]:
df.head()  #top 5

       Name  Age         City
0     Alice   25     New York
1       Bob   30  Los Angeles
2   Charlie   35      Chicago
3    Tanzim   22        Dhaka
4  Arunima    25   Chittagong

In [10]:
df.head()       # Show first 5 rows

       Name  Age         City
0     Alice   25     New York
1       Bob   30  Los Angeles
2   Charlie   35      Chicago
3    Tanzim   22        Dhaka
4  Arunima    25   Chittagong

In [11]:
df.tail()       # Show last 5 rows

       Name  Age         City
1       Bob   30  Los Angeles
2   Charlie   35      Chicago
3    Tanzim   22        Dhaka
4  Arunima    25   Chittagong
5     Karim   21       Khulna

In [12]:
df.shape        # Rows and columns count

(6, 3)

In [13]:
df.info()       # Info about dataset

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    6 non-null      object
 1   Age     6 non-null      int64
 2   City    6 non-null      object
dtypes: int64(1), object(2)
memory usage: 276.0+ bytes

In [14]:
df.describe()   # Summary statistics

             Age
count   6.000000
mean   26.333333
std     5.278889
min    21.000000
25%    22.750000
50%    25.000000
75%    28.750000
max    35.000000

In [15]:
df['Name']             # Select single column
df[['Name', 'Age']]    # Select multiple columns

       Name  Age
0     Alice   25
1       Bob   30
2   Charlie   35
3    Tanzim   22
4  Arunima    25
5     Karim   21

In [16]:
df.iloc[4]             # Select row by index

Name      Arunima
Age             25
City    Chittagong
Name: 4, dtype: object

In [17]:
df.loc[4]              # Select row by label

Name      Arunima
Age             25
City    Chittagong
Name: 4, dtype: object

In [18]:
# Filter people older than 22
df[df['Age'] > 22]

       Name  Age         City
0     Alice   25     New York
1       Bob   30  Los Angeles
2   Charlie   35      Chicago
4  Arunima    25   Chittagong

In [19]:

df['Salary'] = [30000, 35000, 25000, 30000, 23000, 24000]  # Add new column

In [20]:
#df['Salary'] = [30000, 35000, 25000]  # Add new column
df['Age'] = df['Age'] + 1             # Update column
#df.drop('City', axis=1, inplace=True) # Delete column

In [21]:
import numpy as np

# Step 1: Generate 100 linearly spaced points between 50 and 60
arr = np.linspace(50, 60, 100)
print("Original Array:\n", arr)

# Step 2: Convert the vector (1D array) into a (10, 10) matrix
matrix = arr.reshape(10, 10)
print("\nMatrix (10x10):\n", matrix)

# Step 3: Perform the operation (array % 5 == 0)
result = matrix % 5 == 0
print("\nMatrix where elements divisible by 5:\n", result)

Original Array:
 [50.         50.1010101  50.2020202  50.3030303  50.4040404  50.50505051
 50.60606061 50.70707071 50.80808081 50.90909091 51.01010101 51.11111111
 51.21212121 51.31313131 51.41414141 51.51515152 51.61616162 51.71717172
 51.81818182 51.91919192 52.02020202 52.12121212 52.22222222 52.32323232
 52.42424242 52.52525253 52.62626263 52.72727273 52.82828283 52.92929293
 53.03030303 53.13131313 53.23232323 53.33333333 53.43434343 53.53535354
 53.63636364 53.73737374 53.83838384 53.93939394 54.04040404 54.14141414
 54.24242424 54.34343434 54.44444444 54.54545455 54.64646465 54.74747475
 54.84848485 54.94949495 55.05050505 55.15151515 55.25252525 55.35353535
 55.45454545 55.55555556 55.65656566 55.75757576 55.85858586 55.95959596
 56.06060606 56.16161616 56.26262626 56.36363636 56.46464646 56.56565657
 56.66666667 56.76767677 56.86868687 56.96969697 57.07070707 57.17171717
 57.27272727 57.37373737 57.47474747 57.57575758 57.67676768 57.77777778
 57.87878788 57.97979798 58.08080808 58.18181818 58.28282828 58.38383838
 58.48484848 58.58585859 58.68686869 58.78787879 58.88888889 58.98989899
 59.09090909 59.19191919 59.29292929 59.39393939 59.49494949 59.5959596
 59.6969697  59.7979798  59.8989899  60.        ]

Matrix (10x10):
 [[50.         50.1010101  50.2020202  50.3030303  50.4040404  50.50505051
  50.60606061 50.70707071 50.80808081 50.90909091]
 [51.01010101 51.11111111 51.21212121 51.31313131 51.41414141 51.51515152
  51.61616162 51.71717172 51.81818182 51.91919192]
 [52.02020202 52.12121212 52.22222222 52.32323232 52.42424242 52.52525253
  52.62626263 52.72727273 52.82828283 52.92929293]
 [53.03030303 53.13131313 53.23232323 53.33333333 53.43434343 53.53535354
  53.63636364 53.73737374 53.83838384 53.93939394]
 [54.04040404 54.14141414 54.24242424 54.34343434 54.44444444 54.54545455
  54.64646465 54.74747475 54.84848485 54.94949495]
 [55.05050505 55.15151515 55.25252525 55.35353535 55.45454545 55.55555556
  55.65656566 55.75757576 55.85858586 55.95959596]
 [56.06060606 56.16161616 56.26262626 56.36363636 56.46464646 56.56565657
  56.66666667 56.76767677 56.86868687 56.96969697]
 [57.07070707 57.17171717 57.27272727 57.37373737 57.47474747 57.57575758
  57.67676768 57.77777778 57.87878788 57.97979798]
 [58.08080808 58.18181818 58.28282828 58.38383838 58.48484848 58.58585859
  58.68686869 58.78787879 58.88888889 58.98989899]
 [59.09090909 59.19191919 59.29292929 59.39393939 59.49494949 59.5959596
  59.6969697  59.7979798  59.8989899  60.        ]]

Matrix where elements divisible by 5:
 [[ True False False False False False False False False False]
 [False False False False False False False False False False]
 [False False False False False False False False False False]
 [False False False False False False False False False False]
 [False False False False False False False False False False]
 [False False False False False False False False False False]
 [False False False False False False False False False False]
 [False False False False False False False False False False]
 [False False False False False False False False False False]
 [False False False False False False False False False  True]]